
#Область СлужебныйПрограммныйИнтерфейс

// Регламентное задание "Отправка сообщений в Телеграм"
// 
Процедура ОтправкаСообщенийВТелеграм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|   ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка КАК Сообщение,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОтправитьСообщение(ВыборкаДетальныеЗаписи.ТекстСообщения);

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение(ТекстСообщения)
	
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", , , , , Истина);
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = СтрШаблон("/bot[%1]/sendMessage", Токен);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("chat_id", ИдентификаторГруппы);
	СтруктураЗапроса.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));
    ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
    
	РезультатЗапроса = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		
		Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Отправка сообщений в Телеграм", УровеньЖурналаРегистрации.Ошибка, , , Ответ);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти