
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	// Сохранение предыдущих значений реквизитов для последующего сравнения
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
	"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
	РеквизитыДокумента.Вставить("ЭтоНовый", ЭтоНовый());
	
	ДополнительныеСвойства.Вставить("РеквизитыДокумента", РеквизитыДокумента);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеквизитыДокумента = ДополнительныеСвойства.РеквизитыДокумента;
	
	Если РеквизитыДокумента.ЭтоНовый
	Или ДатаПроведенияРабот <> РеквизитыДокумента.ДатаПроведенияРабот
	Или ВремяНачалаРабот <> РеквизитыДокумента.ВремяНачалаРабот
	Или ВремяОкончанияРабот <> РеквизитыДокумента.ВремяОкончанияРабот
	Или Специалист <> РеквизитыДокумента.Специалист Тогда
	
		Если РеквизитыДокумента.ЭтоНовый Тогда
		
			ТекстСообщения = СтрШаблон("Введен новый документ %1.
			|Дата проведения работ: %2
			|с %3 до %4, Специалист - %5",
			Номер,
			Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"),
			Формат(ВремяНачалаРабот, "ДЛФ=T;"),
			Формат(ВремяОкончанияРабот, "ДЛФ=T;"),
			Специалист);
		
		Иначе
			
			ТекстСообщения = СтрШаблон("Изменен документ %1.
			|Дата проведения работ: %2
			|с %3 до %4, Специалист - %5",
			Номер,
			Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"),
			Формат(ВремяНачалаРабот, "ДЛФ=T;"),
			Формат(ВремяОкончанияРабот, "ДЛФ=T;"),
			Специалист);
		
		КонецЕсли;
		
		НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
		НовоеУведомление.ТекстСообщения = ТекстСообщения;
		НовоеУведомление.Заполнить(Неопределено);
		
		Попытка
			НовоеУведомление.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось сформировать уведомление по причине: %1",
			ОписаниеОшибки()));		
		КонецПопытки;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора") <>
	ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Выбран договор с типом, отличным от ""Абонентское обслуживание"".
		|Документ не может быть проведен!");
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаНачалаДействияДоговора") > ДатаПроведенияРабот Или
	 ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаОкончанияДействияДоговора") < ДатаПроведенияРабот Тогда
	 	
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Указанная дата проведения работ не входит в период действия договора.
		|Документ не может быть проведен!");
		
	КонецЕсли;
	
	ПроцентОплаты = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.ПроцентОплатыОтРаботСотрудника(Специалист, Дата);
	Если ПроцентОплаты = Неопределено Тогда 
	
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не назначен процент оплаты от работ сотруднику.
		|Документ не может быть проведен!");
		
	КонецЕсли;
	
	СтоимостьЧасаРаботыСпециалиста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботыСпециалиста");
	
	Если Не Отказ Тогда

		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту), 0) КАК ЧасыКОплатеКлиенту
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка";
	
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			// регистр ВКМ_ВыполненныеКлиентуРаботы
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате =	ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботыСпециалиста;
		
			// регистр ВКМ_ВыполненныеСотрудникомРаботы
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Специалист;
			Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботыСпециалиста
			* ПроцентОплаты / 100;
		
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
