
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ВыводДополнительныхРеквизитов();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ВыводДополнительныхРеквизитов()

	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_ДатаНачалаДействияДоговора";        
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    
    НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_ДатаОкончанияДействияДоговора";        
    
    НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаЕжемесячнойАбонентскойПлаты", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_СуммаЕжемесячнойАбонентскойПлаты";        
    
    НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_СтоимостьЧасаРаботыСпециалиста";        
	
КонецПроцедуры

#КонецОбласти