
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление =
        ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// ВКМ Губанова ++

// При определении настроек печати.
// 
// Параметры:
//  НастройкиОбъекта - Структура - Настройки объекта
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Добавить команды печати.
// 
// Параметры:
//  КомандыПечати - Структура - Команды печати
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт об оказанных услугах
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанныхУслугах";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 5;
	
КонецПроцедуры

// Печать.
// 
// Параметры:
//  МассивОбъектов - Массив - Массив объектов
//  ПараметрыПечати - Структура - Параметры печати
//  КоллекцияПечатныхФорм - Массив - Коллекция печатных форм
//  ОбъектыПечати - Массив - Объекты печати
//  ПараметрыВывода - Структура - Параметры вывода
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанныхУслугах");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент =
	    ПечатьАктаОбОказанныхУслугах(КоллекцияПечатныхФорм, МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ВКМ_ПФ_DOC_АктОбОказанныхУслугах";
	КонецЕсли;
	
КонецПроцедуры

// ВКМ Губанова --

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ Губанова --

Функция ПечатьАктаОбОказанныхУслугах(КоллекцияПечатныхФорм, МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОбОказанныхУслугах";
	    
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанныхУслугах");
	ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТипМакета = "DOC";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ВКМ_ПФ_DOC_АктОбОказанныхУслугах");
	
	СсылкаНаМакет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(Макет, ТипМакета);
	
	ПечатнаяФормаWord = УправлениеПечатью.ИнициализироватьПечатнуюФорму(
	ТипМакета, СсылкаНаМакет.НастройкиСтраницыМакета, СсылкаНаМакет);
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	СтруктураОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(СтруктураОбластей, "Шапка", "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(СтруктураОбластей, "Данные", "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(СтруктураОбластей, "Подвал", "Общая");
	
	Для Каждого Документ Из ДанныеДокументов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// 1. Вывод заголовка документа.
		ОбластьМакета = УправлениеПечатью.ОбластьМакета(СсылкаНаМакет, СтруктураОбластей.Шапка);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФормаWord, ОбластьМакета, Документ);
	
		// 2. Вывод табличной части.
		ОбластьМакета = УправлениеПечатью.ОбластьМакета(СсылкаНаМакет, СтруктураОбластей.Данные);
		УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФормаWord, ОбластьМакета, Документ.Услуги);  

		// 3. Вывод подвала документа.
		ОбластьМакета = УправлениеПечатью.ОбластьМакета(СсылкаНаМакет, СтруктураОбластей.Подвал);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФормаWord, ОбластьМакета, Документ);
		
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Документ.Ссылка);
            
		АдресХранилищаОфисныйДокумент = УправлениеПечатью.СформироватьДокумент(ПечатнаяФормаWord);
	 
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФормаWord, Ложь);
		УправлениеПечатью.ОчиститьСсылки(СсылкаНаМакет);
	
		ОфисныеДокументы = Новый Соответствие;
		ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, НСтр("ru = 'Акт об оказанных услугах'"));
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;	
		
	КонецЦикла;	
		
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДокументов(МассивДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Ответственный КАК Ответственный,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугУслуги.Количество КАК Количество,
	|	РеализацияТоваровУслугУслуги.Цена КАК Цена,
	|	РеализацияТоваровУслугУслуги.Сумма КАК Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивДокументов)
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПараметрыДокументов = Новый Массив;
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("Ссылка", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
		ПараметрыДокумента.Вставить("Номер", "");
		ПараметрыДокумента.Вставить("Дата", Дата(1, 1, 1));
		ПараметрыДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		ПараметрыДокумента.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		ПараметрыДокумента.Вставить("Договор", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		ПараметрыДокумента.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
		ПараметрыДокумента.Вставить("СуммаДокумента", 0);
		ПараметрыДокумента.Вставить("СуммаДокументаПрописью", "");
		
		ЗаполнитьЗначенияСвойств(ПараметрыДокумента, ВыборкаДокументы);
		ПараметрыДокумента.Дата = Формат(ПараметрыДокумента.Дата, "ДФ=dd.MM.yyyy;");
		ПараметрыДокумента.СуммаДокументаПрописью = ЧислоПрописью(ВыборкаДокументы.СуммаДокумента);
		
		ВыборкаУслуги = ВыборкаДокументы.Выбрать();
		
		ПараметрыДокумента.Вставить("Услуги", Новый Массив);
		
		Пока ВыборкаУслуги.Следующий() Цикл
		
			Услуга = Новый Структура;
			Услуга.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			Услуга.Вставить("Количество", 0);
			Услуга.Вставить("Цена", 0);
			Услуга.Вставить("Сумма", 0);
		
			ЗаполнитьЗначенияСвойств(Услуга, ВыборкаУслуги);
		
			ПараметрыДокумента.Услуги.Добавить(Услуга);			
			
		КонецЦикла;
		
		ПараметрыДокументов.Добавить(ПараметрыДокумента);	
	
	КонецЦикла;
	
	Возврат ПараметрыДокументов;
	
КонецФункции

// ВКМ Губанова --

#КонецОбласти

#КонецЕсли
