
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ПодсчетКоличестваДнейОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПодсчетКоличестваДнейОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуАнализГрафика(Команда)
	
	Адрес = ПоместитьГрафикВоВременноеХранилище();
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("АдресДанныеГрафика", Адрес);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыОткрытияФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодсчетКоличестваДнейОтпуска(СтрокаТЧ)

	ДлительностьОтпускаСотрудникаВСекундах = СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала;	
	СтрокаТЧ.КоличествоДнейОтпуска = ДлительностьОтпускаСотрудникаВСекундах / (24 * 60 * 60);
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Сотрудник", СтрокаТЧ.Сотрудник);
	
	СтрокиПоСотруднику = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
	КоличествоДнейОтпускаВсего = 0;
	Для Каждого Строка Из СтрокиПоСотруднику Цикл
	
		КоличествоДнейОтпускаВсего = КоличествоДнейОтпускаВсего + Строка.КоличествоДнейОтпуска;		
		
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиПоСотруднику Цикл
	
		Строка.ОбщееКоличествоДнейОтпуска = КоличествоДнейОтпускаВсего;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьГрафикВоВременноеХранилище()
	
	Данные = РеквизитФормыВЗначение("Объект.ОтпускаСотрудников").Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(Данные);
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти