
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьДокументыДляАбонентскихДоговоров(Знач Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|		И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, Месяц) = &Период
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = Период;
		НовыйДокумент.Организация = ВыборкаДетальныеЗаписи.Организация;
		НовыйДокумент.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		НовыйДокумент.Договор = ВыборкаДетальныеЗаписи.Договор;
		НовыйДокумент.Комментарий = "Создан автоматически";
		НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
		НовыйДокумент.Заполнить(Неопределено);
		
		// Запись документа
		Попытка
			НовыйДокумент.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Запись реализации", УровеньЖурналаРегистрации.Ошибка, , ,
			СтрШаблон("Не удалось создать реализацию по договору %1", ВыборкаДетальныеЗаписи.Договор));	 	
		КонецПопытки;

		// Проведение документа
		Если НовыйДокумент.ПроверитьЗаполнение() Тогда
	
			Попытка
				НовыйДокумент.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Проведение реализации", УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон("Не удалось провести реализацию %1", НовыйДокумент));	 	
			КонецПопытки;
	
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли