
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГрафикОтпусков.Обновление = Ложь;
	
	ДанныеГрафика = ПолучитьИзВременногоХранилища(Параметры.АдресДанныеГрафика);
	
	Если ЗначениеЗаполнено(ДанныеГрафика) Тогда
		ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
		ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГода(ДанныеГрафика[0].ДатаНачала), КонецГода(ДанныеГрафика[0].ДатаОкончания));
	КонецЕсли;
	
	ГрафикОтпусков.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
	ГрафикОтпусков.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Фиксированная;
	ГрафикОтпусков.КратностьПериодическогоВарианта = 4;
	
	Для Каждого Строка Из ДанныеГрафика Цикл
	
		ТочкаСотрудник = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);
		ТочкаСотрудник.Текст = Строка(Строка.Сотрудник);
		
		СерияОтпуск = ГрафикОтпусков.УстановитьСерию("Отпуск");
		СерияОтпуск.Текст = "Отпуск";
		
		Отпуск = ГрафикОтпусков.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		
		ИнтервалОтпуск = Отпуск.Добавить();
		ИнтервалОтпуск.Начало = Строка.ДатаНачала;
		ИнтервалОтпуск.Конец = Строка.ДатаОкончания;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
