
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВКМ_ГрафикОтпусков
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	
	Для Каждого ТекСтрокаОтпускаСотрудников из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Год;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
		Движение.КоличествоДнейОтпуска = ТекСтрокаОтпускаСотрудников.КоличествоДнейОтпуска;
		Движение.ОбщееКоличествоДнейОтпуска = ТекСтрокаОтпускаСотрудников.ОбщееКоличествоДнейОтпуска;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли