
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияОсновныеНачисления();
	
	СформироватьДвиженияДополнительныеНачисления();
	
	РассчитатьОклад();
	
	РассчитатьОтпускные();
	
	РассчитатьПроцентЗаВыполненныеРаботы();
	
	РассчитатьНДФЛ();
	
	СформироватьДвиженияРасчетыССотрудниками();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания КАК ДатаОкончания,
		|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПериодыОкладов
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.ОсновныеНачисления КАК ВКМ_НачисленияЗарплатыОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО ВКМ_НачисленияЗарплатыОсновныеНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудников.Сотрудник
		|		И ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала >= ВКМ_УсловияОплатыСотрудников.Период
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаОклад
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.НомерСтроки,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПериодыОкладов.НомерСтроки КАК НомерСтроки,
		|	ВТ_ПериодыОкладов.Сотрудник КАК Сотрудник,
		|	ВТ_ПериодыОкладов.ВидРасчета КАК ВидРасчета,
		|	ВТ_ПериодыОкладов.ДатаНачала КАК ПериодДействияНачало,
		|	ВТ_ПериодыОкладов.ДатаОкончания КАК ПериодДействияКонец,
		|	ВКМ_УсловияОплатыСотрудников.Оклад КАК Показатель,
		|	NULL КАК БазовыйПериодНачало,
		|	NULL КАК БазовыйПериодКонец
		|ИЗ
		|	ВТ_ПериодыОкладов КАК ВТ_ПериодыОкладов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО ВКМ_УсловияОплатыСотрудников.Сотрудник = ВТ_ПериодыОкладов.Сотрудник
		|		И ВТ_ПериодыОкладов.Период = ВКМ_УсловияОплатыСотрудников.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.НомерСтроки,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала,
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаОкончания,
		|	NULL,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -12), МЕСЯЦ),
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачисленияЗарплатыОсновныеНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.ОсновныеНачисления КАК ВКМ_НачисленияЗарплатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачисленияЗарплатыОсновныеНачисления.ВидРасчета = &ВидРасчетаОтпуск";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ПериодРегистрации = Дата;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(); 
	
КонецПроцедуры

Процедура СформироватьДвиженияДополнительныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПериодыПроцентовПремий
		|ИЗ
		|	Документ.ВКМ_НачисленияЗарплаты.ДополнительныеНачисления КАК ВКМ_НачисленияЗарплатыДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО ВКМ_НачисленияЗарплатыДополнительныеНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудников.Сотрудник
		|		И ВКМ_УсловияОплатыСотрудников.Период <= &Период
		|ГДЕ
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачисленияЗарплатыДополнительныеНачисления.ВидРасчета = &ВидРасчетаПроцентЗаВыполненныеРаботы
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.НомерСтроки,
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.Сотрудник,
		|	ВКМ_НачисленияЗарплатыДополнительныеНачисления.ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПериодыПроцентовПремий.НомерСтроки КАК НомерСтроки,
		|	ВТ_ПериодыПроцентовПремий.Сотрудник КАК Сотрудник,
		|	ВТ_ПериодыПроцентовПремий.ВидРасчета КАК ВидРасчета,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 0) КАК Показатель
		|ИЗ
		|	ВТ_ПериодыПроцентовПремий КАК ВТ_ПериодыПроцентовПремий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО ВКМ_УсловияОплатыСотрудников.Сотрудник = ВТ_ПериодыПроцентовПремий.Сотрудник
		|		И ВТ_ПериодыПроцентовПремий.Период = ВКМ_УсловияОплатыСотрудников.Период";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаПроцентЗаВыполненныеРаботы", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыполненныеРаботы);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.ПериодРегистрации = Дата;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать(); 
	
КонецПроцедуры

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|	И ВидРасчета = &ВидРасчетаОклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Если ВыборкаДетальныеЗаписи.План <> 0 Тогда
			Движение.Результат = Движение.Показатель * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План;	
		КонецЕсли;
		
		Движение.НормаДней = ВыборкаДетальныеЗаписи.План;
		Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
		
	КонецЦикла;	
	
	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);
	
КонецПроцедуры

Процедура РассчитатьОтпускные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК РезультатБаза,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НормаДнейБаза КАК НормаДнейБаза,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза КАК ОтработаноДнейБаза,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|	РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало, ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) КАК КоличествоДнейОтпуска
		|ПОМЕСТИТЬ ВТ_База
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
		|			&Измерения,
		|			&Измерения,
		|			,
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НормаДней,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ОтработаноДней,
		|	ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействия,
		|	0
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
		|			&Измерения,
		|			&Измерения,
		|			,
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_База.НомерСтроки КАК НомерСтроки,
		|	СУММА(ВТ_База.РезультатБаза) КАК РезультатБаза,
		|	СУММА(ВТ_База.НормаДнейБаза) КАК НормаДнейБаза,
		|	СУММА(ВТ_База.ОтработаноДнейБаза) КАК ОтработаноДнейБаза,
		|	ВТ_База.ПериодДействия КАК ПериодДействия,
		|	МАКСИМУМ(ВТ_База.КоличествоДнейОтпуска) КАК КоличествоДнейОтпуска
		|ИЗ
		|	ВТ_База КАК ВТ_База
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_База.НомерСтроки,
		|	ВТ_База.ПериодДействия";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		
		СреднедневнаяЗарплата = ВыборкаДетальныеЗаписи.РезультатБаза / ВыборкаДетальныеЗаписи.ОтработаноДнейБаза;
		Движение.Результат = СреднедневнаяЗарплата * ВыборкаДетальныеЗаписи.КоличествоДнейОтпуска; 
		Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.КоличествоДнейОтпуска;
		Движение.Показатель = СреднедневнаяЗарплата;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);
	
КонецПроцедуры

Процедура РассчитатьПроцентЗаВыполненныеРаботы()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплатеОборот
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(НАЧАЛОПЕРИОДА(&Период, Месяц),
	|			КОНЕЦПЕРИОДА(&Период, Месяц),,) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|	И ВКМ_ДополнительныеНачисления.ВидРасчета = &ВидРасчетаПроцентЗаВыполненныеРаботы";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаПроцентЗаВыполненныеРаботы", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыполненныеРаботы);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.Результат = ВыборкаДетальныеЗаписи.СуммаКОплатеОборот;	
		
	КонецЦикла;	
	
	Движения.ВКМ_ДополнительныеНачисления.Записать( , Истина);
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.Результат КАК Результат
		|ПОМЕСТИТЬ ВТ_ВсеНачисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНачисления.Сотрудник КАК Сотрудник,
		|	ВТ_ВсеНачисления.Результат КАК Результат
		|ИЗ
		|	ВТ_ВсеНачисления КАК ВТ_ВсеНачисления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Результат = ВыборкаДетальныеЗаписи.Результат * 13 / 100;
		Движение.ПериодРегистрации = Дата;
		Движение.Показатель = ВыборкаДетальныеЗаписи.Результат;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияРасчетыССотрудниками()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.Результат КАК Результат
		|ПОМЕСТИТЬ ВТ_ВсеНачисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник,
		|	-ВКМ_Удержания.Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_ВсеНачисления.Результат) КАК Сумма
		|ИЗ
		|	ВТ_ВсеНачисления КАК ВТ_ВсеНачисления
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
