
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВКМ_ПриВыбореВидаДоговора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	ВКМ_ПриВыбореВидаДоговора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_ПриВыбореВидаДоговора()

	Если Объект.ВидДоговора	=
	ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда	
		ЭтоАбонентскийДоговор = Истина;
	Иначе
		ЭтоАбонентскийДоговор = Ложь;	
	КонецЕсли;
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = ЭтоАбонентскийДоговор;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = ЭтоАбонентскийДоговор;
	Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость = ЭтоАбонентскийДоговор;
	Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = ЭтоАбонентскийДоговор;
	
КонецПроцедуры

#КонецОбласти