
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	ОбновитьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ДлительнаяОперация = СоздатьДокументыНаСервере(Объект.Период);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДанныеПослеСозданияАктов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеПослеСозданияАктов(Ответ, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
	
	Объект.ДоговорыИРеализации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Ссылка КАК Договор,
			|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Документ,
			|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
			|	ДоговорыКонтрагентов.Организация КАК Организация
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
			|		И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, Месяц) = &Период
			|ГДЕ
			|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		НоваяСтрока = Объект.ДоговорыИРеализации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДокументыНаСервере(Знач Период)
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
	"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыДляАбонентскихДоговоров", Период);	
	
КонецФункции

#КонецОбласти


